In [2]:
import pandas as pd
import numpy as np
from scipy import stats

In [3]:
df = pd.read_csv("knn_assignment_training_data.csv")
df

  Student_name  GMAT_score  Work_exp  International_awards Admission
0          Ram         750         0                     4       Yes
1       Ganesh         720         1                     2       Yes
2        Anand         710         2                     0        No
3       Mukesh         690         0                     1        No
4      Shankar         670         4                     2       Yes
5      Chinmay         650         6                     2       Yes
6         Aman         600         1                     0        No

In [8]:
query=pd.read_csv("KNN_assignment_query.csv")
query

  Student_name  GMAT_score  Work_exp  International_awards
0         Amit         700         1                     2

In [6]:
feature_data = np.array(df.iloc[:,1:-1])
target_data = np.array(df.iloc[:,-1:])
query_data=np.array(query.iloc[:,1:])

In [7]:
feature_data

array([[750,   0,   4],
       [720,   1,   2],
       [710,   2,   0],
       [690,   0,   1],
       [670,   4,   2],
       [650,   6,   2],
       [600,   1,   0]])

In [9]:
target_data

array([['Yes'],
       ['Yes'],
       ['No'],
       ['No'],
       ['Yes'],
       ['Yes'],
       ['No']], dtype=object)

In [10]:
query_data

array([[700,   1,   2]])

In [11]:
distance  = np.sqrt(np.sum(np.square(query_data-feature_data),axis=1))
df['distance']=distance

In [12]:
df

,Student_name,GMAT_score,Work_exp,International_awards,Admission,distance
0,Ram,750,0,4,Yes,50.049975
1,Ganesh,720,1,2,Yes,20.000000
2,Anand,710,2,0,No,10.246951
3,Mukesh,690,0,1,No,10.099505
4,Shankar,670,4,2,Yes,30.149627
5,Chinmay,650,6,2,Yes,50.249378
6,Aman,600,1,0,No,100.019998

In [13]:
sorted_index = np.argsort(distance)
k=5
k_indexes = sorted_index[0:k]
knn_target = target_data[k_indexes]
query_pred = stats.mode(knn_target)[0][0][0]
df_sorted = df.sort_values(by=['distance'])

In [14]:
df_sorted

,Student_name,GMAT_score,Work_exp,International_awards,Admission,distance
3,Mukesh,690,0,1,No,10.099505
2,Anand,710,2,0,No,10.246951
1,Ganesh,720,1,2,Yes,20.000000
4,Shankar,670,4,2,Yes,30.149627
0,Ram,750,0,4,Yes,50.049975
5,Chinmay,650,6,2,Yes,50.249378
6,Aman,600,1,0,No,100.019998

In [15]:
df.loc[np.where(df['Student_name']=='Ram')[0][0]]['distance']

50.049975024968795

In [16]:
df.where(df['Student_name']=='Ram')['distance']

0    50.049975
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
Name: distance, dtype: float64

In [45]:
print("The distance between Amit and Ram : ", df.loc[np.where(df['Student_name']=='Ram')[0][0]]['distance'])
print("The top 3 nearest neighbors to query point Amit are : ", end = " ")
for i, item in enumerate(np.array(df_sorted)[:3, :1]):
    if i != len(np.array(df_sorted)[:3, :1])-1:
        print(item[0], end = ", ")
    else:
        print(item[0], end = ".")
        print("")
print("If k = 5, will Amit can get admission : ", query_pred)

The distance between Amit and Ram =  50.049975024968795
The top 3 nearest neighbors to query point Amit are:  Mukesh, Anand, Ganesh.
If k = 5, will Amit can get admission:  Yes